Revit 2027 API
View.AnalysisDisplayStyleId Property
 Element id of Analysis Display Style associated with the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AnalysisDisplayStyleId { get; set; }
Public Property AnalysisDisplayStyleId As ElementId
	Get
	Set
public:
property ElementId^ AnalysisDisplayStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member AnalysisDisplayStyleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: Cannot set the AnalysisDisplayStyleId for the specified view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace